Running a `terraform plan` locally shows a totally different result 

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.training-vm-eu[2] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-2.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[3] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-3.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[4] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-4.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[5] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-5.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[6] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-6.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[7] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-7.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[8] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-8.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[9] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-9.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # openstack_compute_instance_v2.training-vm-eu[2] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-2.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[3] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-3.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[4] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-4.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[5] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-5.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[6] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-6.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[7] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-7.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[8] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-8.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[9] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gat-9.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_keypair_v2.cloud2 will be created
  + resource "openstack_compute_keypair_v2" "cloud2" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cloud2"
      + private_key = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDV7gfNbNN5O8vH6/tM/iOFXKBP2YKRHXOmdfV8ogvu9BdVV0IPmDzk2EooVpThDE1VMv1hz3811tvBhHRJ6IgNhVIV/61w/+RazQD/AU27X8bX+Hb9EQ/bP4DW+6ySd/z5vdDLzpH5dbiMhzPEDkXVsylUT+hkQnas6cHspDhHmtKQ5MWOgDe3D/IEudTDJQe8hxxaU4TaZUmFzn7eYp9HvuK8qW0yCy4NWOxJJHA+G5wSCyLuKnaKo4AitUIzSKF1AB94oq7b96KONhPxgRptAk4OYIUTdNFbrI5HDaSNzHLnF5FbjQvG+Eu6m5nY5yvJMogE+jiuWeIXCZTCFljg287FUo0ohmbZpd802L6VXun14VumRC+rRgPrvBALo/CsyCsPIoBSTKhVElxKVOcRjmTLNfrUZM0GQxqJhIvah8BV+JTExkipPwkrKTdMAWIXvCoehxV+WMpBWqtEEzAzEoqJpaiec7HfriwsHTGESZWAPYEbFjzbHXQZtqBkbOvtokPMRmTWfWKxaplCMN6ddJeeY6faorD0w/e6lszWES1Q1ieajiPKDy37UvybKKvPTk4o3MzyzYOS4c8HQj+jnGeR5Q3ETuyz4psLyOfuBtIrfOeuxV42rFDmkYM3IrrRR+F9oklFG6Ig8DVfgQEzSG36NkgvpF4OdFvigYqXvw== cloud@vgcn"
      + region      = (known after apply)
    }

  # openstack_compute_keypair_v2.cloud3 will be created
  + resource "openstack_compute_keypair_v2" "cloud3" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cloud3"
      + private_key = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDD7DmOPC++GYjiNx8xc38U3dPQ5oKbtDC18cS8CXTPCWt7nYakjOPGwI0OcmBq46xvhIuBE2EUubORfMBou+RzFW/GuaqWVix3RBoAj69bcZDZGkP0/FidqU0Ar+G0gnNKSls0NpDiZ4gUJgrBwKw1q9atdYDxaZhJ9DfmOxJuJnZRi1g6fi+DNTib5jSRKjiKqHrtIrnnf66tY98lmmyEDEUthGScV0CPFujQ/fJ2flZCTi8+wpccJZ0DMFjDnrEBa8WnE8J6OuieEk8jnn+eOQ2EIZkde8jlmnbQk/fgQHxCAL0P+w4LcmTVD32j/Ao1/+G+/3cTYtXN+PwIIynOUvPFUs4wwU2Jp/7S7Zvxig3koNuoSKJHCUi+9xOkcPxRy6CVPQ+70bpZXlgqxDSIEsb7wubteQXDBSvqlJqyn70/pW+GHOronhyyX6zpRQNDhIZs1f7K+0hRfQqFawxgNT0UdlPl99YkK/aONBRax4aGJ618zlNAANBz+qd1kP6XualYyzsJL6v4DlYioILLPo1oUhlhl+zpB3R/CA6+UQ7n1US0vKS4X34zFjiNXQlvSwuIDMFcnx3o7mOcBVEquYfuVzAU5ECa/f+eLoUff5jV0DasiYpnHwFGfrd8izu+ah0wkn45SBZoMeCeGtCP0bJwTXiA2JsS2X2dak4ccw== centos@sn06"
      + region      = (known after apply)
    }

  # openstack_compute_keypair_v2.jenkins2 will be created
  + resource "openstack_compute_keypair_v2" "jenkins2" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "jenkins2"
      + private_key = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDfQrCU7MkCPHoFt6kwBnh3kZMd38WMbP4TSmaYrRjqwNAqlW9zoyHMy/eU+Gvb87hjSm9EZG8GOoHAkkqy1s7G6qQWNfYoxyQmbxs/nj3mtvFRKfow8WUmt2Xew5tXWJX1GxWtpyNn4ytrB7iGJRyiGN1R/g6qyBu/rxWtVvWxz79THajJqt5zgJFvnnLDOj9wlUIdA6lXlMOE0fUzdXsBNhZGWMwMCo+hd3i+SHsuK5QvBGPz/c9SdfzyKfg8JFmb2dfMCfybhsAeGO315qZWe1t7fgwVYiFRcOvTpZ0SR7sFPfmEAzm4sIF10n1EIADB70tfmsWsPX42oC/l4Zp1"
      + region      = (known after apply)
    }

  # random_pet.training-vm-eu[2] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[3] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[4] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[5] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[6] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[7] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[8] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[9] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ training_dns-eu = [
      - [
          - "gat-0.eu.training.galaxyproject.eu",
          - "gat-1.eu.training.galaxyproject.eu",
        ],
      + [
          + "gat-0.eu.training.galaxyproject.eu",
          + "gat-1.eu.training.galaxyproject.eu",
          + "gat-2.eu.training.galaxyproject.eu",
          + "gat-3.eu.training.galaxyproject.eu",
          + "gat-4.eu.training.galaxyproject.eu",
          + "gat-5.eu.training.galaxyproject.eu",
          + "gat-6.eu.training.galaxyproject.eu",
          + "gat-7.eu.training.galaxyproject.eu",
          + "gat-8.eu.training.galaxyproject.eu",
          + "gat-9.eu.training.galaxyproject.eu",
        ],
    ]
  ~ training_ips-eu = [
      - [
          - "192.52.42.44",
          - "192.52.42.10",
        ],
      + [
          + "192.52.42.44",
          + "192.52.42.10",
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]
  ~ training_pws-eu = (sensitive value)

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```